<template>
    <div class="PrivacyShow">
        <van-icon class="return" name="arrow-left" @click="$router.go(-1)" />
        <h1 class="tit">隐私政策</h1>
        本隐私政策将帮助您了解以下内容：<br />
        1、我们如何收集和使用您的个人信息；<br />
        2、我们如何保存和保护您的个人信息； <br />
        3、您如何管理您的个人信息； <br />
        【特别提示】请您在使用我们提供的各项服务前，仔细阅读并充分理解本隐私政策（重点内容我们以黑体加粗或加下划线的形式提示您重点注意）并作出相应选择。一旦您选择使用或继续使用我们的服务，即意味着您同意我们按照本隐私政策处理您的相关信息。<br />
        请您注意，不同应用的功能可能存在一定的差异，具体以您实际使用的功能为准。<br />
        此外，针对某些特定的服务，我们还将制定单独的隐私政策，向您说明这些服务的特殊政策。如相关特定的隐私政策与本隐私政策有不一致之处，适用相关特定隐私政策。
        请您注意，本隐私政策不适用于您通过我们的服务而接入的其他第三方产品/服务(“其他第三方”包括您的交易相对方、任何第三方网站以及第三方服务提供者等)，具体规定请参照该第三方的隐私政策或类似声明。我们建议您在接受相关服务和提供个人信息前阅读并确认理解该等隐私政策。<br />
        <h3>一、我们如何收集和使用您的个人信息</h3>
        在您使用我们的服务时，我们可能在以下场景收集和使用您的个人信息，其中的个人敏感信息我们以下划线的形式标记：<br />
        为了向您提供我们服务的基本功能，我们需要收集、使用必要的个人信息，如您拒绝提供该等必要信息，您将无法正常使用我们的服务。我们会遵循正当、合法、必要的原则，出于本隐私政策所述的您的个人信息。<br />
        <h3>二、我们如何保存和保护您的个人信息</h3>
        （一）个人信息的保存<br />
        1、保存期限：除非依据法律法规规定或双方约定，我们仅会在实现目的所必需的最短时间内留存您的相关个人信息。<br />
        2、保存地域：我们在中华人民共和国境内收集的个人信息，将存储在中国境内。如果我们需要向境外传输您的个人信息，我们将按照相关法律法规的要求完成相应的程序，我们会一并要求数据接收方按照本隐私政策以及其他相关的安全保密措施来处理个人信息以为您的个人信息提供不低于中国数据保护法律法规规定的保护标准。<br />
        3、终止运营：如果发生终止运营等情形，我们将会至少提前30天通知您，并在终止运营后对您的个人信息进行删除或匿名化处理。<br />
        （二）个人信息的保护措施<br />
        1、数据安全措施。为保障您的信息安全，我们采取了各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息，同时，我们建立了数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。蜜雪冰城通过信息接触者保密协议、监控和审计机制对数据进行全面的安全防控，防止您的个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失，例如在您的浏览器与“服务”之间交换数据(如信用卡信息)时采用SSL加密保护技术;同时对网站本身提供https安全浏览方式;使用加密技术确保数据的保密性;使用受信赖的保护机制防止数据遭到恶意攻击;部署访问控制机制，确保只有授权人员才可访问个人信息;举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。<br />
        2、请您知悉并理解，互联网并非绝对安全的环境，我们强烈建议您设置复杂密码并使用安全方式登录账号，协助我们保证您的账号安全。如您发现自己的个人信息泄露，尤其是您的账户或密码发生泄露，请您立即根据本隐私政策中提供的联系方式联络我们，以便我们采取相应措施。<br />
        3、安全事件。在不幸发生个人信息安全事件后，我们会立即成立专项应急小组，启动应急预案，防止安全事件扩大，并按照法律法规的规定及时向您告知如下相关事宜:安全事件的基本情况和可能产生的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。<br />
        <h3>三、您如何管理您的个人信息</h3>
        您对您的个人信息享有以下权利:<br />
        （一）您有权访问、更正、删除您的个人信息。<br />
        您可以通过访问、更正您账户中的个人资料及账号信息等方式管理您的账户信息。如果您无法通过上述链接管理这些个人信息，您可以随时通过本隐私政策“如何联系我们”一节提供的联系方式联系我们。我们将在收到您的反馈之日起15天内回复您的访问请求。<br />
        （二）改变您授权同意的范围或撤回授权<br />
        您可以通过在应用中删除信息、更改隐私设置或者在系统中关闭设备权限功能等方式改变同意范围或撤回您的授权。请您理解，当您执行上述操作后，我们将无法继续为您提供撤回同意或授权所对应的服务，但不会影响此前基于您的授权已经开展的个人信息处理。。如果您无法通过上述链接完成这些操作，您可以随时通过本隐私政策“如何联系我们”一节提供的联系方式联系我们。我们将在收到您的反馈之日起15天内回复您的访问请求。
    </div>
</template>

<script>
export default {
    name: "Privacy",
};
</script>

<style scoped>
.PrivacyShow {
    padding: 1rem;
    overflow-y: auto;
    font-size: 0.9rem;
}
.return {
    font-size: 1.5rem;
}
.tit {
    margin: 0.8rem 0;
    text-align: center;
}
</style>