<template>
    <div class="UserShow">
        <van-icon class="return" name="arrow-left" @click="$router.go(-1)" />
        <h1 class="tit">用户服务协议</h1>
        欢迎您注册用户账号并使用我们的服务！<br />
        本《用户服务协议》（以下简称“本服务协议”）是您与我们之间就注册用户账号及使用各项服务等相关事宜所订立的协议。为使用我们的服务，您应当仔细阅读并遵守本服务协议下的全部内容，特别是涉及免除或者责任限制的条款，该类条款可能以黑体加粗或加下划线的形式提示您重点注意。除非您已阅读并接受本服务协议所有条款，否则您将不能注册用户账号或使用的服务，如您不同意本服务条款的任意内容，请勿注册或使用我们的服务，并应立即停止注册程序。如您对本服务协议的内容（特别是涉及免除或者责任限制的条款）有任何疑义，可随时按照本服务协议中列明的联系方式与我们联系，我们将根据您的要求为您进一步解释和说明相关内容。如您勾选“已阅读并同意《用户服务协议》”并通过注册程序或其他任何方式使用或接受我们的任何服务，即视为您已阅读并同意本服务协议，自愿接受本服务协议所有内容的约束。请您在决定注册或使用服务前再次确认您已知悉并完全理解本服务协议的所有内容。<br />
        如果您未满18周岁，请务必在您的父母或者其他监护人的陪同下阅读本服务协议，并在进行注册、下单、支付等任何行为或使用其他任何服务前，应事先征得您的父母或者其他监护人的同意。
    </div>
</template>

<script>
export default {
    name: "UserShow",
};
</script>

<style scoped>
.UserShow {
    padding: 1rem;
    overflow-y: auto;
    font-size: 0.9rem;
}
.return {
    font-size: 1.5rem;
}
.tit {
    margin: 0.8rem 0;
    text-align: center;
}
</style>